elua/elua/src/platform/lm3s/platform.c
  return PLATFORM_OK;
}


int platform_adc_start_sequence()
{ 
  elua_adc_dev_state *d = adc_get_dev_state( 0 );
  
  if( d->running != 1 )
  {
    adc_update_dev_sequence( 0 );

    MAP_ADCSequenceEnable( ADC_BASE, d->seq_id );
    d->running = 1;

    if( d->clocked == 1 )
    {
      MAP_TimerControlTrigger(timer_base[d->timer_id], TIMER_A, true);
      MAP_TimerEnable(timer_base[d->timer_id], TIMER_A);
    }
    else
    {
      MAP_ADCProcessorTrigger( ADC_BASE, d->seq_id );
    }
  }
  
  return PLATFORM_OK;
}

#endif // ifdef BUILD_ADC

// ****************************************************************************
// Support for specific onboard devices on 
// Texas Instruments / Luminary Micro kits.
//
// FIXME: This was previously tied to the "disp" module but should be renamed in the future
//        to include support for initialization of other onboard devices of the EK-LM3Sxxxx kits.
//        Note that not all kits have all devices available.

void lm3s_disp_init( unsigned long freq )
{
  RIT128x96x4Init( freq );
}

void lm3s_disp_clear()
{
  RIT128x96x4Clear();
}

void lm3s_disp_stringDraw( const char *str, unsigned long x, unsigned long y, unsigned char level )
{
  RIT128x96x4StringDraw( str, x, y, level );
}

void lm3s_disp_imageDraw( const unsigned char *img, unsigned long x, unsigned long y,
                              unsigned long width, unsigned long height )
{
  RIT128x96x4ImageDraw( img, x, y, width, height );
}


void lm3s_disp_enable( unsigned long freq )
{
  RIT128x96x4Enable( freq );
}

void lm3s_disp_disable()
{
  RIT128x96x4Disable();
}

void lm3s_disp_displayOn()
{
  RIT128x96x4DisplayOn();
}

void lm3s_disp_displayOff()
{
  RIT128x96x4DisplayOff();
}


// ****************************************************************************
// Ethernet functions

#ifdef BUILD_UIP

#define SYSTICK_ETH_LIMIT_MS    500

static int eth_timer_fired;
static u8 eth_initialized;
static u16 eth_counter;
static volatile u8 eth_forced;

void platform_eth_send_packet( const void* src, u32 size )
{
  MAP_EthernetPacketPut( ETH_BASE, uip_buf, uip_len );
}

u32 platform_eth_get_packet_nb( void* buf, u32 maxlen )
{
  return MAP_EthernetPacketGetNonBlocking( ETH_BASE, uip_buf, sizeof( uip_buf ) );
}

void platform_eth_force_interrupt()
{
  eth_forced = 1;
  NVIC_SW_TRIG_R |= INT_ETH - 16;
}

int platform_eth_get_link_status()
{
  return ( EthernetPHYRead( ETH_BASE, PHY_MR1 ) & PHY_MR1_LINK ) ? PLATFORM_ETH_LINK_UP : PLATFORM_ETH_LINK_DOWN;
}

u32 platform_eth_get_elapsed_time()
{
  if( eth_timer_fired )
  {
    eth_timer_fired = 0;
    return SYSTICK_ETH_LIMIT_MS;
  }
  else
    return 0;
}

void SysTickIntHandler()
{
  // Handle virtual timers
  cmn_virtual_timer_cb();

  if( eth_initialized )
  {
    eth_counter += SYSTICKMS;
    if( eth_counter == SYSTICK_ETH_LIMIT_MS )
    {
      eth_counter = 0;
      eth_timer_fired = 1;
      // Generate a fake Ethernet interrupt.  This will perform the actual work
      // of incrementing the timers and taking the appropriate actions.
      platform_eth_force_interrupt();
    }
  }

  // System timer handling
  cmn_systimer_periodic();
}

void EthernetIntHandler()
{
  u32 temp;

  if( !eth_initialized )
    return;
  if( eth_forced )
  {
    elua_uip_mainloop();
    eth_forced = 0;
    return;
  }
  // Check for both RX and PHY interrupts
  temp = MAP_EthernetIntStatus( ETH_BASE, false );
  if( temp & MAC_RIS_PHYINT )
  {
    // Check link changed interrupt (and clear all PHY interrupts)
    if( MAP_EthernetPHYRead( ETH_BASE, PHY_MR17 ) & PHY_MR17_LSCHG_INT )
      elua_net_link_changed();
  }
  // Check packet RX interrupt
  if( temp & MAC_RIS_RXINT )
    elua_uip_mainloop();
  // Clear all ETH interrupts
  MAP_EthernetIntClear( ETH_BASE, temp );
}

#else  // #ifdef ELUA_UIP

void SysTickIntHandler()
{
  cmn_virtual_timer_cb();

  // System timer handling
  cmn_systimer_periodic();
}

void EthernetIntHandler()
{
}
#endif // #ifdef ELUA_UIP

static void eth_init()
{
#ifdef BUILD_UIP
  u32 user0, user1, temp;
  static struct uip_eth_addr sTempAddr;

  // Enable and reset the controller
  MAP_SysCtlPeripheralEnable( SYSCTL_PERIPH_ETH );
  MAP_SysCtlPeripheralReset( SYSCTL_PERIPH_ETH );

#if defined( FORLM3S9B92 ) || defined(FORLM3S9D92)
  GPIOPinConfigure(GPIO_PF2_LED1);
  GPIOPinConfigure(GPIO_PF3_LED0);
#endif

  // Enable Ethernet LEDs
  MAP_GPIODirModeSet( GPIO_PORTF_BASE, GPIO_PIN_2 | GPIO_PIN_3, GPIO_DIR_MODE_HW );
  MAP_GPIOPadConfigSet( GPIO_PORTF_BASE, GPIO_PIN_2 | GPIO_PIN_3, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD );

  // Configure SysTick for a periodic interrupt.
  MAP_SysTickPeriodSet( MAP_SysCtlClockGet() / SYSTICKHZ);
  MAP_SysTickEnable();
  MAP_SysTickIntEnable();

  // Intialize the Ethernet Controller and disable all Ethernet Controller interrupt sources.
  MAP_EthernetIntDisable(ETH_BASE, (ETH_INT_PHY | ETH_INT_MDIO | ETH_INT_RXER |
                     ETH_INT_RXOF | ETH_INT_TX | ETH_INT_TXER | ETH_INT_RX));
  temp = MAP_EthernetIntStatus(ETH_BASE, false);
  MAP_EthernetIntClear(ETH_BASE, temp);

  // Initialize the Ethernet Controller for operation.
  MAP_EthernetInitExpClk(ETH_BASE, MAP_SysCtlClockGet());

  // Configure the Ethernet Controller for normal operation.
  // - Full Duplex
  // - TX CRC Auto Generation
  // - TX Padding Enabled
  MAP_EthernetConfigSet(ETH_BASE, (ETH_CFG_TX_DPLXEN | ETH_CFG_TX_CRCEN | ETH_CFG_TX_PADEN));

  // Enable the Ethernet Controller.
  MAP_EthernetEnable(ETH_BASE);

  // Enable the Ethernet RX Packet interrupt and the PHY link status changed interrupt
  MAP_EthernetPHYWrite(ETH_BASE, PHY_MR17, MAP_EthernetPHYRead(ETH_BASE, PHY_MR17) | PHY_MR17_LSCHG_IE );
  MAP_EthernetIntEnable(ETH_BASE, ETH_INT_RX | ETH_INT_PHY);

  // Enable the Ethernet interrupt.
  MAP_IntEnable(INT_ETH);

  // Enable all processor interrupts.
  MAP_IntMasterEnable();

  // Configure the hardware MAC address for Ethernet Controller filtering of
  // incoming packets.
  //
  // For the Ethernet Eval Kits, the MAC address will be stored in the
  // non-volatile USER0 and USER1 registers.  These registers can be read
  // using the FlashUserGet function, as illustrated below.


#if defined( ELUA_BOARD_SOLDERCORE )
  user0 = 0x00b61a00;
  user1 = 0x006d0a00;
#else
  MAP_FlashUserGet(&user0, &user1);
#endif
  

  // Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC
  // address needed to program the hardware registers, then program the MAC
  // address into the Ethernet Controller registers.
  sTempAddr.addr[0] = ((user0 >>  0) & 0xff);
  sTempAddr.addr[1] = ((user0 >>  8) & 0xff);
  sTempAddr.addr[2] = ((user0 >> 16) & 0xff);
  sTempAddr.addr[3] = ((user1 >>  0) & 0xff);
  sTempAddr.addr[4] = ((user1 >>  8) & 0xff);
  sTempAddr.addr[5] = ((user1 >> 16) & 0xff);

  // Program the hardware with it's MAC address (for filtering).
  MAP_EthernetMACAddrSet(ETH_BASE, (unsigned char *)&sTempAddr);

  // Initialize the eLua uIP layer
  elua_net_init( &sTempAddr );
  eth_initialized = 1;
#endif
}

// ****************************************************************************
// USB functions

